with open("v14.txt", encoding='utf-8') as file:
    txt = file.read().split(" ")

stopWord = ["он", "мы", "его", "вы", "вам", "вас", "ее", "что", "который", "их",
            "все", "они", "я", "весь", "мне", "меня", "таким", "для", "на", "по",
            "со", "из", "от", "до", "без", "над", "под", "за", "при", "после", "во"
            "не", "же", "то", "бы", "всего", "итого", "даже", "да", "нет",
            "что-то", "какой-то", "где-то", "как-то", "дальше", "ближе", "раньше", "позже", "когда-то",
            "очень", "минимально", "максимально", "абсолютно", "огромный", "предельно", "сильно", "слабо", "самый"]

count = 0

for i in stopWord:
    for j in txt:
        if i == j:
            count += 1

rez = (count * 100)/len(txt)
print(str(rez) + " %")

